---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.InconsistentInnerOuterOriginalLoopCCW
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.InconsistentInnerOuterOriginalLoopCCW

A face where the CCW of inner loop is inconsistent with CCW of the
 outer loop.
 Associated numbers are face and inner loop indices respectively.